yienlyu/STM32-Util/Camera-5640-driver/Src/stm32_5640.c
#include "../Inc/stm32_5640.h"

#include "stm32l496g_discovery_camera.h"
#include "ov9655.h"
#include "ov5640.h"
#include "stm32l496g_discovery.h"
#include "stm32l496g_discovery_io.h"

#include "../Inc/stm32_5640_bus.h"

#define DCMI_PWR_EN_Pin GPIO_PIN_6
#define DCMI_PWR_EN_GPIO_Port GPIOC

// STM32H747I_DISCO_CAMERA_Private_Variables Private Variables
static CAMERA_Drv_t *Camera_Drv = NULL;
static CAMERA_Capabilities_t Camera_Cap;
static uint32_t HSPolarity = DCMI_HSPOLARITY_LOW;
static uint32_t CameraId;


// STM32H747I_DISCO_CAMERA_Private_Variables Private Variables
void                *Camera_CompObj = NULL;
DCMI_HandleTypeDef  hcamera_dcmi;
CAMERA_Ctx_t        Camera_Ctx[CAMERA_INSTANCES_NBR];

// STM32H747I_DISCO_CAMERA_Private_FunctionsPrototypes Private Functions Prototypes
static int32_t GetSize(uint32_t Resolution, uint32_t PixelFormat);
static void DCMI_MspInit(DCMI_HandleTypeDef *hdcmi);
static void DCMI_MspDeInit(DCMI_HandleTypeDef *hdcmi);
#if (USE_HAL_DCMI_REGISTER_CALLBACKS == 1)
static void DCMI_LineEventCallback(DCMI_HandleTypeDef *hdcmi);
static void DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi);
static void DCMI_VsyncEventCallback(DCMI_HandleTypeDef *hdcmi);
static void DCMI_ErrorCallback(DCMI_HandleTypeDef *hdcmi);
#endif /* (USE_HAL_DCMI_REGISTER_CALLBACKS == 1) */

#if (USE_CAMERA_SENSOR_OV9655 == 1)
static int32_t OV9655_Probe(uint32_t Resolution, uint32_t PixelFormat);
#endif

#if (USE_CAMERA_SENSOR_OV5640 == 1)
static int32_t OV5640_Probe(uint32_t Resolution, uint32_t PixelFormat);
#endif
/**
  * @}
  */
#define CAMERA_VGA_RES_X          640
#define CAMERA_VGA_RES_Y          480
#define CAMERA_480x272_RES_X      480
#define CAMERA_480x272_RES_Y      272
#define CAMERA_QVGA_RES_X         320
#define CAMERA_QVGA_RES_Y         240
#define CAMERA_QQVGA_RES_X        160
#define CAMERA_QQVGA_RES_Y        120



//DCMI_HandleTypeDef  hDcmiHandler;
CAMERA_DrvTypeDef   *camera_drv;
/* Camera current resolution naming (QQVGA, VGA, ...) */
static uint32_t CameraCurrentResolution;

/* Camera module I2C HW address */
static uint32_t CameraHwAddress;

// replace BSP_CAMERA_Init
uint8_t CAMERA_5640_Init(uint32_t Instance, uint32_t Resolution, uint32_t PixelFormat) {
	DCMI_HandleTypeDef *phdcmi;
	uint8_t status = CAMERA_ERROR;
	int32_t ret = BSP_ERROR_NONE;

	/* Get the DCMI handle structure */
	phdcmi = &hcamera_dcmi;


	/* Initialize the IO functionalities */
	BSP_IO_Init();
//	BSP_IO_ConfigPin(CAMERA_PWR_EN_PIN, IO_MODE_OUTPUT);

	/* Camera initialization */
	// Initializes the DCMI MSP -> ok
	// DCMI_MspInit in H7
	BSP_CAMERA_MspInit(&hcamera_dcmi, NULL);

	/* Initialize the camera driver structure */
	// H7
//    if(MX_DCMI_Init(&hcamera_dcmi) != HAL_OK)
//    {
//      ret = BSP_ERROR_PERIPH_FAILURE;
//    }
	/*** Configures the DCMI to interface with the camera module ***/
	/* DCMI configuration */
	phdcmi->Init.CaptureRate      = DCMI_CR_ALL_FRAME;
	phdcmi->Init.HSPolarity       = DCMI_HSPOLARITY_HIGH;
	phdcmi->Init.SynchroMode      = DCMI_SYNCHRO_HARDWARE;
	phdcmi->Init.VSPolarity       = DCMI_VSPOLARITY_HIGH;
	phdcmi->Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
	phdcmi->Init.PCKPolarity      = DCMI_PCKPOLARITY_RISING;
	phdcmi->Init.ByteSelectMode   = DCMI_BSM_ALL;
	phdcmi->Init.LineSelectMode   = DCMI_LSM_ALL;
	phdcmi->Instance              = DCMI;


    if(BSP_CAMERA_HwReset(0) != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_BUS_FAILURE;
    }
    else
    {
#if (USE_CAMERA_SENSOR_OV9655 == 1)
      ret= OV9655_Probe(Resolution, PixelFormat);
#endif
#if (USE_CAMERA_SENSOR_OV5640 == 1)
      if(ret != BSP_ERROR_NONE)
      {
        ret = OV5640_Probe(Resolution, PixelFormat);
      }
#endif
      if(ret != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_UNKNOWN_COMPONENT;
      }
      else
      {
        if((CameraId == OV9655_ID) || (CameraId == OV9655_ID_2))
        {
          if(Resolution == CAMERA_R480x272)
          {
            if(HAL_DCMI_ConfigCROP(&hcamera_dcmi,           /* Crop in the middle of the VGA picture */
                                   (CAMERA_VGA_RES_X - CAMERA_480x272_RES_X)/2,
                                   (CAMERA_VGA_RES_Y - CAMERA_480x272_RES_Y)/2,
                                   (CAMERA_480x272_RES_X * 2) - 1,
                                   CAMERA_480x272_RES_Y - 1) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if(HAL_DCMI_EnableCROP(&hcamera_dcmi) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
        }
        else
        {
          HSPolarity = DCMI_HSPOLARITY_HIGH;
          /* Initialize the camera driver structure */
//          if(MX_DCMI_Init(&hcamera_dcmi) != HAL_OK)
//          {
//            ret = BSP_ERROR_PERIPH_FAILURE;
//          }
        }

        if(ret == BSP_ERROR_NONE)
        {
          if(BSP_CAMERA_HwReset(0) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_BUS_FAILURE;
          }
        }

        if(ret == BSP_ERROR_NONE)
        {
          Camera_Ctx[Instance].CameraId  = CameraId;
#if (USE_HAL_DCMI_REGISTER_CALLBACKS == 1)
          /* Register DCMI LineEvent, FrameEvent and Error callbacks */
          if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_LINE_EVENT_CB_ID, DCMI_LineEventCallback) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          else if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_FRAME_EVENT_CB_ID, DCMI_FrameEventCallback) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          else if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_VSYNC_EVENT_CB_ID, DCMI_VsyncEventCallback) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          else if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_ERROR_CB_ID, DCMI_ErrorCallback) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          else
          {
            ret = BSP_ERROR_NONE;
          }
#endif /* (USE_HAL_DCMI_REGISTER_CALLBACKS == 1) */
        }
        if(ret == BSP_ERROR_NONE)
        {
          Camera_Ctx[Instance].Resolution  = Resolution;
          Camera_Ctx[Instance].PixelFormat = PixelFormat;
        }
      }
    }

  /* BSP status */
  return ret;

