yienlyu/STM32-Util/Camera-5640-driver/Src/stm32_5640.c
}
//
//int32_t BSP_CAMERA_DeInit(uint32_t Instance)
//{
//  int32_t ret;
//
//  if(Instance >= CAMERA_INSTANCES_NBR)
//  {
//    ret = BSP_ERROR_WRONG_PARAM;
//  }
//  else
//  {
//    if((Camera_CompObj == NULL)||(Camera_Drv == NULL))
//    {
//      ret = BSP_ERROR_NO_INIT;
//    }
//    else
//    {
//      hcamera_dcmi.Instance = DCMI;
//
//      /* First stop the camera to insure all data are transferred */
//      if(BSP_CAMERA_Stop(Instance) != BSP_ERROR_NONE)
//      {
//        ret = BSP_ERROR_PERIPH_FAILURE;
//      }
//      else if(HAL_DCMI_DisableCROP(&hcamera_dcmi)!= HAL_OK)
//      {
//        ret = BSP_ERROR_PERIPH_FAILURE;
//      }
//      else if(HAL_DCMI_DeInit(&hcamera_dcmi) != HAL_OK)
//      {
//        ret = BSP_ERROR_PERIPH_FAILURE;
//      }
//      else
//      {
//#if (USE_HAL_DCMI_REGISTER_CALLBACKS == 0)
//        DCMI_MspDeInit(&hcamera_dcmi);
//#endif /* (USE_HAL_DCMI_REGISTER_CALLBACKS == 0) */
//
//        if(Camera_Drv->DeInit(Camera_CompObj) != BSP_ERROR_NONE)
//        {
//          ret = BSP_ERROR_COMPONENT_FAILURE;
//        }/* Set Camera in Power Down */
//        else if(BSP_CAMERA_PwrDown(0) != BSP_ERROR_NONE)
//        {
//          ret = BSP_ERROR_BUS_FAILURE;
//        }
//        else
//        {
//          ret = BSP_ERROR_NONE;
//        }
//      }
//    }
//  }
//  /* Return BSP status */
//  return ret;
//}


#if (USE_HAL_DCMI_REGISTER_CALLBACKS == 1)
/**
  * @brief Default BSP CAMERA Msp Callbacks
  * @param Instance CAMERA Instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_RegisterDefaultMspCallbacks (uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_DCMI_RESET_HANDLE_STATE(&hcamera_dcmi);

    /* Register MspInit/MspDeInit Callbacks */
    if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_MSPINIT_CB_ID, DCMI_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_MSPDEINIT_CB_ID, DCMI_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      Camera_Ctx[Instance].IsMspCallbacksValid = 1;
    }
  }
  /* Return BSP status */
  return ret;
}

/**
  * @brief BSP CAMERA Msp Callback registering
  * @param Instance     CAMERA Instance.
  * @param CallBacks    pointer to MspInit/MspDeInit callbacks functions
  * @retval BSP status
  */
int32_t BSP_CAMERA_RegisterMspCallbacks(uint32_t Instance, BSP_CAMERA_Cb_t *CallBacks)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_DCMI_RESET_HANDLE_STATE(&hcamera_dcmi);

    /* Register MspInit/MspDeInit Callbacks */
    if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_MSPINIT_CB_ID, CallBacks->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_DCMI_RegisterCallback(&hcamera_dcmi, HAL_DCMI_MSPDEINIT_CB_ID, CallBacks->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      Camera_Ctx[Instance].IsMspCallbacksValid = 1;
    }
  }
  /* Return BSP status */
  return ret;
}
#endif /* (USE_HAL_DCMI_REGISTER_CALLBACKS == 1) */

/**
  * @brief  Starts the camera capture in continuous mode.
  * @param  Instance Camera instance.
  * @param  pBff     pointer to the camera output buffer
  * @param  Mode CAMERA_MODE_CONTINUOUS or CAMERA_MODE_SNAPSHOT
  * @retval BSP status
  */
int32_t BSP_CAMERA_Start(uint32_t Instance, uint32_t pBff, uint32_t Mode)
{
  int32_t ret;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(HAL_DCMI_Start_DMA(&hcamera_dcmi, Mode, (uint32_t)pBff, (uint32_t)GetSize(Camera_Ctx[Instance].Resolution, Camera_Ctx[Instance].PixelFormat)) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}



/**
  * @brief  Stop the CAMERA capture
  * @param  Instance Camera instance.
  * @retval BSP status
  */
//int32_t BSP_CAMERA_Stop(uint32_t Instance)
//{
//  int32_t ret;
//
//  if(Instance >= CAMERA_INSTANCES_NBR)
//  {
//    ret = BSP_ERROR_WRONG_PARAM;
//  }
//  else if(HAL_DCMI_Stop(&hcamera_dcmi) != HAL_OK)
//  {
//    ret = BSP_ERROR_PERIPH_FAILURE;
//  }
//  else
//  {
//    ret = BSP_ERROR_NONE;
//  }
//
//  /* Return BSP status */
//  return ret;
//}
//
///**
//  * @brief Suspend the CAMERA capture
//  * @param  Instance Camera instance.
//  */
//int32_t BSP_CAMERA_Suspend(uint32_t Instance)
//{
//  int32_t ret;
//
//  if(Instance >= CAMERA_INSTANCES_NBR)
//  {
//    ret = BSP_ERROR_WRONG_PARAM;
//  }
//  else if(HAL_DCMI_Suspend(&hcamera_dcmi) != HAL_OK)
//  {
//    return BSP_ERROR_PERIPH_FAILURE;
//  }
//  else
//  {
//    ret = BSP_ERROR_NONE;
//  }
//
//  /* Return BSP status */
//  return ret;
//}
//
///**
//  * @brief Resume the CAMERA capture
//  * @param  Instance Camera instance.
//  */
//int32_t BSP_CAMERA_Resume(uint32_t Instance)
//{
//  int32_t ret;
//
//  if(Instance >= CAMERA_INSTANCES_NBR)
//  {
//    ret = BSP_ERROR_WRONG_PARAM;
//  }
//  else if(HAL_DCMI_Resume(&hcamera_dcmi) != HAL_OK)
//  {
//    ret = BSP_ERROR_PERIPH_FAILURE;
//  }
//  else
//  {
//    ret = BSP_ERROR_NONE;
//  }
//
//  /* Return BSP status */
//  return ret;
//}

/**
  * @brief  Get the Camera Capabilities.
  * @param  Instance  Camera instance.
  * @param  Capabilities  pointer to camera Capabilities
  * @note   This function should be called after the init. This to get Capabilities
  *         from the right camera sensor(OV9655)
  * @retval Component status
  */
int32_t BSP_CAMERA_GetCapabilities(uint32_t Instance, CAMERA_Capabilities_t *Capabilities)
{
  int32_t ret;

  if(Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if(Camera_Drv->GetCapabilities(Camera_CompObj, Capabilities) < 0)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Set the camera pixel format.
  * @param  Instance  Camera instance.
  * @param  PixelFormat pixel format to be configured
  * @retval BSP status
  */
int32_t BSP_CAMERA_SetPixelFormat(uint32_t Instance, uint32_t PixelFormat)
{
  int32_t ret;

