yienlyu/STM32-Util/Camera-5640-driver/Src/stm32_5640.c
  /* Associate the initialized DMA handle to the DCMI handle */
  __HAL_LINKDMA(hdcmi, DMA_Handle, hdma_handler);

  /*** Configure the NVIC for DCMI and DMA ***/
  /* NVIC configuration for DCMI transfer complete interrupt */
  HAL_NVIC_SetPriority(DCMI_IRQn, BSP_CAMERA_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(DCMI_IRQn);

  /* NVIC configuration for DMA2D transfer complete interrupt */
  HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, BSP_CAMERA_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);

  /* Configure the DMA stream */
  HAL_DMA_Init(hdcmi->DMA_Handle);
}

/**
  * @brief  DeInitializes the DCMI MSP.
  * @param  hdcmi  DCMI handle
  * @retval None
  */
static void DCMI_MspDeInit(DCMI_HandleTypeDef *hdcmi)
{
  GPIO_InitTypeDef gpio_init_structure;

  /* Disable NVIC  for DCMI transfer complete interrupt */
  HAL_NVIC_DisableIRQ(DCMI_IRQn);

  /* Disable NVIC for DMA2 transfer complete interrupt */
  HAL_NVIC_DisableIRQ(DMA2_Stream3_IRQn);

  /* Configure the DMA stream */
  (void)HAL_DMA_DeInit(hdcmi->DMA_Handle);

  /* DeInit DCMI GPIOs */
  gpio_init_structure.Pin       = GPIO_PIN_4 | GPIO_PIN_6;
  HAL_GPIO_DeInit(GPIOA, gpio_init_structure.Pin);

  gpio_init_structure.Pin       = GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9;
  HAL_GPIO_DeInit(GPIOB, gpio_init_structure.Pin);

  gpio_init_structure.Pin       = GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_9 | GPIO_PIN_11;
  HAL_GPIO_DeInit(GPIOC, gpio_init_structure.Pin);

  gpio_init_structure.Pin       = GPIO_PIN_3;
  HAL_GPIO_DeInit(GPIOD, gpio_init_structure.Pin);

  gpio_init_structure.Pin       = GPIO_PIN_10;
  HAL_GPIO_DeInit(GPIOG, gpio_init_structure.Pin);



  /* Disable DCMI clock */
  __HAL_RCC_DCMI_CLK_DISABLE();
}

#if (USE_HAL_DCMI_REGISTER_CALLBACKS == 0)
/**
  * @brief  Line event callback
  * @param  hdcmi  pointer to the DCMI handle
  * @retval None
  */
//void HAL_DCMI_LineEventCallback(DCMI_HandleTypeDef *hdcmi)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(hdcmi);
//
//  BSP_CAMERA_LineEventCallback();
//}
//
///**
//  * @brief  Frame event callback
//  * @param  hdcmi pointer to the DCMI handle
//  * @retval None
//  */
//void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(hdcmi);
//
//  BSP_CAMERA_FrameEventCallback();
//}

/**
  * @brief  Vsync event callback
  * @param  hdcmi pointer to the DCMI handle
  * @retval None
  */
//void HAL_DCMI_VsyncEventCallback(DCMI_HandleTypeDef *hdcmi)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(hdcmi);
//
//  BSP_CAMERA_VsyncEventCallback(0);
//}

/**
  * @brief  Error callback
  * @param  hdcmi pointer to the DCMI handle
  * @retval None
  */
//void HAL_DCMI_ErrorCallback(DCMI_HandleTypeDef *hdcmi)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(hdcmi);
//
//  BSP_CAMERA_ErrorCallback(0);
//}
#else
/**
  * @brief  Line event callback
  * @param  hdcmi  pointer to the DCMI handle
  * @retval None
  */
static void DCMI_LineEventCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);

  BSP_CAMERA_LineEventCallback(0);
}

/**
  * @brief  Frame event callback
  * @param  hdcmi pointer to the DCMI handle
  * @retval None
  */
static void DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);

  BSP_CAMERA_FrameEventCallback(0);
}

/**
  * @brief  Vsync event callback
  * @param  hdcmi  pointer to the DCMI handle
  * @retval None
  */
static void DCMI_VsyncEventCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);

  BSP_CAMERA_VsyncEventCallback(0);
}

/**
  * @brief  Error callback
  * @param  hdcmi pointer to the DCMI handle
  * @retval None
  */
static void DCMI_ErrorCallback(DCMI_HandleTypeDef *hdcmi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmi);

  BSP_CAMERA_ErrorCallback(0);
}
#endif /* (USE_HAL_DCMI_REGISTER_CALLBACKS == 0) */

/**
  * @brief  Line Event callback.
  * @param  Instance Camera instance.
  * @retval None
  */
//__weak void BSP_CAMERA_LineEventCallback(uint32_t Instance)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(Instance);
//
//  /* NOTE : This function Should not be modified, when the callback is needed,
//            the HAL_DCMI_LineEventCallback could be implemented in the user file
//   */
//}
//
///**
//  * @brief  Frame Event callback.
//  * @param  Instance Camera instance.
//  * @retval None
//  */
//__weak void BSP_CAMERA_FrameEventCallback(uint32_t Instance)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(Instance);
//
//  /* NOTE : This function Should not be modified, when the callback is needed,
//            the HAL_DCMI_FrameEventCallback could be implemented in the user file
//   */
//}
//
///**
//  * @brief  Vsync Event callback.
//  * @param  Instance Camera instance.
//  * @retval None
//  */
//__weak void BSP_CAMERA_VsyncEventCallback(uint32_t Instance)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(Instance);
//
//  /* NOTE : This function Should not be modified, when the callback is needed,
//            the HAL_DCMI_FrameEventCallback could be implemented in the user file
//   */
//}
//
///**
//  * @brief  Error callback.
//  * @param  Instance Camera instance.
//  * @retval None
//  */
//__weak void BSP_CAMERA_ErrorCallback(uint32_t Instance)
//{
//  /* Prevent unused argument(s) compilation warning */
//  UNUSED(Instance);
//
//  /* NOTE : This function Should not be modified, when the callback is needed,
//            the HAL_DCMI_ErrorCallback could be implemented in the user file
//   */
//}

/**
  * @}
  */

/** @defgroup STM32H747I_DISCO_CAMERA_Private_Functions Private Functions
  * @{
  */

#if (USE_CAMERA_SENSOR_OV9655 == 1)
/**
  * @brief  Register Bus IOs if component ID is OK
  * @retval error status
  */
static int32_t OV9655_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret;
  OV9655_IO_t              IOCtx;
  static OV9655_Object_t   OV9655Obj;

  /* Configure the audio driver */
  IOCtx.Address     = CAMERA_OV9655_ADDRESS;
  IOCtx.Init        = BSP_I2C2_Init;
  IOCtx.DeInit      = BSP_I2C2_DeInit;
  IOCtx.ReadReg     = BSP_I2C2_ReadReg;
  IOCtx.WriteReg    = BSP_I2C2_WriteReg;
  IOCtx.GetTick     = BSP_GetTick;

